/*
Пимслер советовал повторять фразу 11 раз. Можно сделать проще и обойтись девятью подходами: прочитать, повторить через 30 минут, потом — на следующее утро, потом — через три дня, неделю, месяц, три месяца, полгода и через год.
Если повторять фразу 10 секунд (два озвучивания по пять секунд), то понадобится полторы минуты в год.
*/
/*
время следующего повторения записывается в юникс формате, 
на больших интервалах время на повторение один день,
возможность ввода списка слов(фраз)
расчет расписания для группы слов(фраз)
напоминание о следующем повторении
ведение статистики по словам(фразам) и их распределению по временным интервалам
прогноз количества и времени слов для повторения на завтра, послезавтра
напомининие оставшихся слов на сегодня и по времени
*/
var dataMnenotechnic = {
    item: [
        {
            word: 'hello world!',
            second5: 0,
            second25: 0,
            minute2: 0,
            minute10: 0,
            hour1: 0,
            hour5: 0,
            day1: 0,
            day5: 0,
            day25: 0,
            month4: 0,
            year2: 0
        }
    ]
}
let test =         {
    word: 'redicule',
    russ: 'смешной нелепый',
    second5: 0,
    second25: 0,
    minute2: 0,
    minute10: 0,
    hour1: 0,
    hour5: 0,
    day1: 0,
    day5: 0,
    day25: 0,
    month4: 0,
    year2: 0
}

dataMnenotechnic.item.push(test)
console.log(dataMnenotechnic.item[0].word)